forum-geografia/app/views/posts/new.html.erb

SELECT "assuntos".* FROM "assuntos"
---

        <%= f.select :assunto, ([["globalização", "0"], ["rochas", "1"]])%>