forum-geografia/app/controllers/login_controller.rb

SELECT  "usuarios".* FROM "usuarios"  WHERE "usuarios"."login" = 'kasuefinato' AND "usuarios"."senha" = '19c53c47752ceb03e2a6c924691c1e3a' LIMIT 1
---
	def login
		u = Usuario.find_by_login_and_senha(params[:login], Digest::MD5.hexdigest(params[:senha]))