forum-geografia/app/controllers/posts_controller.rb

SELECT "assuntos".* FROM "assuntos"
---
	def new
		@post = Post.new()
		@assuntos = Assunto.all

SELECT  "usuarios".* FROM "usuarios"  WHERE "usuarios"."id" = ? LIMIT 1  [["id", 1]]
---
	def create

		@post = Post.new(params.require(:post).permit(:conteudo, :assunto_id))
		#@aluno = Aluno.new params.require(:aluno).
		#		permit(:nome, :matricula, :senha, :email, :turma_id)

		usuario = Usuario.find (session[:usuario_id])

INSERT INTO "assuntos" ("assunto", "created_at", "tipo", "updated_at") VALUES (?, ?, ?, ?)  [["assunto", "teste Assunto"], ["created_at", "2014-12-04 02:41:22.492439"], ["tipo", 2], ["updated_at", "2014-12-04 02:41:22.492439"]]
SELECT  "assuntos".* FROM "assuntos"  WHERE "assuntos"."assunto" = 'Falta de agua' LIMIT 1
---
    		end

    		outroassuntosalva.assunto = outroassunto
    		outroassuntosalva.save
	    	x = Assunto.find_by_assunto ("#{outroassuntosalva.assunto}")

INSERT INTO "posts" ("assunto_id", "conteudo", "created_at", "data", "updated_at", "usuario_id") VALUES (?, ?, ?, ?, ?, ?)
---
	    end
    	#@post.assunto = assunto

    	if @post.save

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "usuarios".* FROM "usuarios"  WHERE "usuarios"."id" = ? LIMIT 1  [["id", 1]]
---
	def show_comentar
		@coment = Comentario.new()
		@post = Post.find params[:id]
		@criador = Usuario.find @post.usuario_id

SELECT "assuntos".* FROM "assuntos"  WHERE "assuntos"."tipo" = 1
SELECT "posts".* FROM "posts"  WHERE "posts"."assunto_id" = 6
---
	def show_humanas
		assuntos = Assunto.where(tipo: 2)
		assuntos.each do |assunto|
			x = assunto.id
			@posts = Post.where(assunto_id: x)

SELECT "assuntos".* FROM "assuntos"  WHERE "assuntos"."tipo" = 1
SELECT "posts".* FROM "posts"  WHERE "posts"."assunto_id" = 2
---
	def show_fisicas
		assuntos = Assunto.where(tipo: 1)
		assuntos.each do |assunto|
			x = assunto.id
			@posts = Post.where(assunto_id: x)