forum-geografia/app/controllers/posts_controller.rb

	def mcomentar
		@post = Post.find params[:id]
		@criador = Usuario.find @post.usuario_id
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 0]]
SELECT  "usuarios".* FROM "usuarios"  WHERE "usuarios"."id" = ? LIMIT 1  [["id", 1]]