forum-geografia/app/controllers/usuarios_controller.rb

	def create
    	@usuario = Usuario.new(params.require(:usuario).permit(:nome, :email, :login,   :senha))
    	@usuario.senha = Digest::MD5.hexdigest(@usuario.senha)

    	if @usuario.save
---
INSERT INTO "usuarios" ("created_at", "email", "login", "nome", "senha", "updated_at") VALUES (?, ?, ?, ?, ?, ?)